Masmiseim36/nxpSDK/boards/twrk65f180m/project_template/pin_mux.c
/*
 * Copyright 2018-2019 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v5.0
processor: MK65FN2M0xxx18
package_id: MK65FN2M0VMI18
mcu_data: ksdk2_0
processor_version: 0.0.18
board: TWR-K65F180M
pin_labels:
- {pin_num: B1, pin_signal: ADC1_SE5a/PTE1/LLWU_P0/SPI1_SOUT/UART1_RX/SDHC0_D0/TRACE_D3/I2C1_SCL/SPI1_SIN, label: 'J26[B11]/J29[7]/SDHC0_D0/SPI1_SOUT', identifier: SDHC_D0}
- {pin_num: A1, pin_signal: ADC1_SE4a/PTE0/SPI1_PCS1/UART1_TX/SDHC0_D1/TRACE_CLKOUT/I2C1_SDA/RTC_CLKOUT, label: 'J26[B22]/J29[8]/SDHC0_D1', identifier: SDHC_D1}
- {pin_num: C1, pin_signal: ADC1_SE6a/PTE2/LLWU_P1/SPI1_SCK/UART1_CTS_b/SDHC0_DCLK/TRACE_D2, label: 'J26[B7]/J29[5]/SDHC0_DCLK/SPI1_SCK', identifier: SDHC_DCLK}
- {pin_num: D1, pin_signal: ADC1_SE7a/PTE3/SPI1_SIN/UART1_RTS_b/SDHC0_CMD/TRACE_D1/SPI1_SOUT, label: 'J26[B10]/J29[3]/SDHC0_CMD/SPI1_SIN', identifier: SDHC_CMD}
- {pin_num: E1, pin_signal: PTE4/LLWU_P2/SPI1_PCS0/UART3_TX/SDHC0_D3/TRACE_D0, label: 'J26[B9]/J29[2]/SDHC0_D3/SPI1_PCS0', identifier: SDHC_D3}
- {pin_num: H1, pin_signal: USB1_DM/LLWU_P31, label: 'J15[2]/MCU_USB1_HS_DN', identifier: MCU_USB1_HS_DN_DCD;MCU_USB1_HS_DN_PHY}
- {pin_num: J1, pin_signal: USB1_DP/LLWU_P30, label: 'J15[3]/MCU_USB1_HS_DP', identifier: MCU_USB1_HS_DP_PHY;MCU_USB1_HS_DP_DCD}
- {pin_num: G1, pin_signal: USB0_DP, label: 'J26[A55]/MCU_USB0_FS_DP', identifier: MCU_USB0_FS_DP}
- {pin_num: F1, pin_signal: USB0_DM, label: 'J26[A54]/MCU_USB0_FS_DN', identifier: MCU_USB0_FS_DN}
- {pin_num: K1, pin_signal: USB1_VSS, label: GND}
- {pin_num: L1, pin_signal: ADC1_DP1, label: R124/R125/ADC1_DP1}
- {pin_num: M1, pin_signal: ADC1_DM1, label: TP19}
- {pin_num: N1, pin_signal: ADC1_DP0/ADC0_DP3, label: 'J11[9]/J26[A28]/TWRPI_ADC1', identifier: TWRPI_ADC1}
- {pin_num: A2, pin_signal: PTD14/SPI2_SIN/SDHC0_D6/FB_A22, label: 'J12[9]/J26[B44]/SPI2_SIN'}
- {pin_num: B2, pin_signal: PTD12/SPI2_SCK/FTM3_FLT0/SDHC0_D4/FB_A20, label: 'J12[12]/J26[B48]/SPI2_SCK'}
- {pin_num: C2, pin_signal: PTD11/LLWU_P25/SPI2_PCS0/SDHC0_CLKIN/LPUART0_CTS_b/FB_A19, label: 'J26[B46]/SPI2_PCS0'}
- {pin_num: D2, pin_signal: PTE5/SPI1_PCS2/UART3_RX/SDHC0_D2/FTM3_CH0, label: 'J26[A10]/J29[1]/SDHC0_D2', identifier: SDHC_D2}
- {pin_num: E2, pin_signal: PTE6/LLWU_P16/SPI1_PCS3/UART3_CTS_b/I2S0_MCLK/FTM3_CH1/USB0_SOF_OUT, label: 'J26[A21]/I2S0_MCLK'}
- {pin_num: F2, pin_signal: VREG_IN0, label: 'J23[2]/MCU_VREGIN0', identifier: MCU_VREGIN0}
- {pin_num: G2, pin_signal: VREG_OUT, label: 'J9[7]/MCU_VREGOUT', identifier: MCU_VREGOUT}
- {pin_num: K2, pin_signal: NC183, label: NC}
- {pin_num: H2, pin_signal: VREG_IN1, label: 'J23[3]/MCU_VREGIN1', identifier: MCU_VREGIN1}
- {pin_num: J2, pin_signal: USB1_VBUS/LLWU_P29, label: 'J15[1]/U12[6]/K65_USB1_VBUS', identifier: K65_USB1_VBUS}
- {pin_num: J7, pin_signal: NC184, label: NC}
- {pin_num: L4, pin_signal: TAMPER1, label: 'J4[2]'}
- {pin_num: J5, pin_signal: TAMPER7, label: 'J4[8]'}
- {pin_num: K5, pin_signal: TAMPER3, label: 'J4[4]'}
- {pin_num: L5, pin_signal: TAMPER2, label: 'J4[3]'}
- {pin_num: M5, pin_signal: TAMPER0/RTC_WAKEUP_B, label: 'J4[1]/RTC_WAKEUP', identifier: RTC_WAKEUP}
- {pin_num: J6, pin_signal: TAMPER6, label: 'J4[7]'}
- {pin_num: K6, pin_signal: TAMPER5, label: 'J4[6]'}
- {pin_num: L6, pin_signal: TAMPER4, label: 'J4[5]'}
- {pin_num: L2, pin_signal: ADC0_DM0/ADC1_DM3, label: 'J11[18]/TWRPI_ID1', identifier: TWRPI_ID1}
- {pin_num: M2, pin_signal: ADC0_DP0/ADC1_DP3, label: 'J11[17]/TWRPI_ID0', identifier: TWRPI_ID0}
- {pin_num: N2, pin_signal: ADC1_DM0/ADC0_DM3, label: 'J11[12]/J26[A29]/TWRPI_ADC2', identifier: TWRPI_ADC2}
- {pin_num: A3, pin_signal: PTD15/SPI2_PCS1/SDHC0_D7/FB_A23, label: 'J12[11]/J15[4]/J26[B47]/microUSB_ID/SPI2_PCS1', identifier: microUSB_ID}
- {pin_num: B3, pin_signal: PTD13/SPI2_SOUT/SDHC0_D5/FB_A21, label: 'J12[10]/J26[B45]/SPI2_SOUT'}
- {pin_num: J4, pin_signal: VSSA, label: GND}
- {pin_num: C3, pin_signal: VSS6, label: GND}
- {pin_num: G3, pin_signal: VSS22, label: GND}
- {pin_num: N7, pin_signal: VSS67, label: GND}
- {pin_num: G8, pin_signal: VSS17, label: GND}
- {pin_num: H8, pin_signal: VSS81, label: GND}
- {pin_num: J8, pin_signal: VSS172, label: GND}
- {pin_num: C11, pin_signal: VSS139, label: GND}
- {pin_num: M12, pin_signal: VSS95, label: GND}
- {pin_num: D3, pin_signal: PTD10/LPUART0_RTS_b/FB_A18, label: 'J26[A63]/J26[B23]/RESET_OUT'}
- {pin_num: E3, pin_signal: PTE7/UART3_RTS_b/I2S0_RXD0/FTM3_CH2, label: 'J26[A24]/I2S0_RXD0'}
- {pin_num: F3, pin_signal: PTE9/LLWU_P17/I2S0_TXD1/I2S0_RX_BCLK/LPUART0_RX/FTM3_CH4, label: 'J26[A58]/I2S0_RX_BCLK'}
- {pin_num: H3, pin_signal: ADC0_SE4a/PTE16/SPI0_PCS0/UART2_TX/FTM_CLKIN0/FTM0_FLT3/TPM_CLKIN0, label: 'J33[2]/U5[4]/UART2_TX', identifier: DEBUG_UART_TX}
- {pin_num: J3, pin_signal: VDDA, label: MCU_PWR}
- {pin_num: G5, pin_signal: VDD5, label: MCU_PWR}
- {pin_num: H5, pin_signal: VDD80, label: MCU_PWR}
- {pin_num: G6, pin_signal: VDD16, label: MCU_PWR}
- {pin_num: H6, pin_signal: VDD140, label: MCU_PWR}
- {pin_num: G7, pin_signal: VDD66, label: MCU_PWR}
- {pin_num: N12, pin_signal: VDD94, label: MCU_PWR}
- {pin_num: H7, pin_signal: VDD173, label: MCU_PWR}
- {pin_num: K3, pin_signal: VREFH, label: MCU_PWR}
- {pin_num: K4, pin_signal: VREFL, label: GND}
- {pin_num: N3, pin_signal: VREF_OUT/CMP1_IN5/CMP0_IN5/ADC1_SE18, label: TP5/VREF_OUT}
- {pin_num: L3, pin_signal: ADC0_SE16/CMP1_IN2/ADC0_SE21, label: 'J11[8]/J26[A27]/J26[A30]/TWRPI_ADC0', identifier: TWRPI_ADC0}
- {pin_num: M3, pin_signal: ADC1_SE16/CMP2_IN2/ADC0_SE22, label: 'J24[1]/J26[D30]/R67[2]/POTJ', identifier: POTJ}
- {pin_num: A4, pin_signal: PTD2/LLWU_P13/SPI0_SOUT/UART2_RX/FTM3_CH2/FB_AD4/SDRAM_A12/I2C0_SCL, label: 'J26[A76]/U14[60]/FB_AD4/SDRAM_A12', identifier: SDRAM_A12}
- {pin_num: B4, pin_signal: PTD3/SPI0_SIN/UART2_TX/FTM3_CH3/FB_AD3/SDRAM_A11/I2C0_SDA, label: 'J26[A77]/U14[61]/FB_AD3/SDRAM_A11', identifier: SDRAM_A11}
- {pin_num: C4, pin_signal: ADC0_SE6b/PTD5/SPI0_PCS2/UART0_CTS_b/UART0_COL_b/FTM0_CH5/FB_AD1/SDRAM_A9/EWM_OUT_b/SPI1_SCK, label: 'J26[A79]/U14[63]/FB_AD1/SDRAM_A9',
  identifier: SDRAM_A9}
- {pin_num: D4, pin_signal: PTD9/I2C0_SDA/LPUART0_TX/FB_A17, label: 'J14[1]/U12[4]/K65_USB_FLGA', identifier: K65_USB_FLGA}
- {pin_num: E4, pin_signal: PTE8/I2S0_RXD1/I2S0_RX_FS/LPUART0_TX/FTM3_CH3, label: 'J26[A59]/I2S0_RX_FS'}
- {pin_num: F4, pin_signal: PTE10/LLWU_P18/I2C3_SDA/I2S0_TXD0/LPUART0_CTS_b/FTM3_CH5/USB1_ID, label: 'J26[A25]/I2S0_TXD0'}
- {pin_num: G4, pin_signal: PTE11/I2C3_SCL/I2S0_TX_FS/LPUART0_RTS_b/FTM3_CH6, label: 'J26[A23]/I2S0_TX_FS'}
- {pin_num: H4, pin_signal: PTE12/I2S0_TX_BCLK/FTM3_CH7, label: 'J26[A22]/I2S0_TX_BCLK'}
- {pin_num: M4, pin_signal: DAC0_OUT/CMP1_IN3/ADC0_SE23, label: 'J26[A32]/DAC0_OUT'}
- {pin_num: N4, pin_signal: DAC1_OUT/CMP0_IN4/CMP2_IN3/ADC1_SE23, label: 'J26[B32]/DAC1_OUT'}
- {pin_num: A5, pin_signal: ADC0_SE5b/PTD1/SPI0_SCK/UART2_CTS_b/FTM3_CH1/FB_CS0_b, label: 'J26[A9]/J26[B64]/FB_CS0/UART2_CTS'}
- {pin_num: B5, pin_signal: PTD4/LLWU_P14/SPI0_PCS1/UART0_RTS_b/FTM0_CH4/FB_AD2/SDRAM_A10/EWM_IN/SPI1_PCS0, label: 'J26[A78]/U14[62]/FB_AD2/SDRAM_A10', identifier: SDRAM_A10}
- {pin_num: C5, pin_signal: ADC0_SE7b/PTD6/LLWU_P15/SPI0_PCS3/UART0_RX/FTM0_CH6/FB_AD0/FTM0_FLT0/SPI1_SOUT, label: 'J26[A80]/FB_AD0'}
- {pin_num: D5, pin_signal: PTD8/LLWU_P24/I2C0_SCL/LPUART0_RX/FB_A16, label: 'J13[2]/U12[3]/microUSB_PWR_EN', identifier: microUSB_PWR_EN}
- {pin_num: E5, pin_signal: PTD7/CMT_IRO/UART0_TX/FTM0_CH7/SDRAM_CKE/FTM0_FLT1/SPI1_SIN, label: 'U14[67]/SDRAM_CKE', identifier: SDRAM_CKE}
- {pin_num: F5, pin_signal: ADC0_SE5a/PTE17/LLWU_P19/SPI0_SCK/UART2_RX/FTM_CLKIN1/LPTMR0_ALT3/TPM_CLKIN1, label: 'J34[2]/U6[2]/UART2_RX', identifier: DEBUG_UART_RX}
- {pin_num: N6, pin_signal: EXTAL32, label: 'Y1[2]/EXTAL32', identifier: EXTAL32K_CLK}
- {pin_num: N5, pin_signal: XTAL32, label: 'Y1[1]/XTAL32', identifier: XTAL32K_CLK}
- {pin_num: A6, pin_signal: PTD0/LLWU_P12/SPI0_PCS0/UART2_RTS_b/FTM3_CH0/FB_ALE/FB_CS1_b/FB_TS_b, label: 'J26[B21]/J26[B63]/UART2_RTS/FB_ALE/FB_CS1'}
- {pin_num: B6, pin_signal: PTC29/I2C3_SCL/ENET0_1588_TMR3/FB_A0/SDRAM_D0, label: 'U14[2]/SDRAM_D0', identifier: SDRAM_D0}
- {pin_num: C6, pin_signal: PTC28/I2C3_SDA/ENET0_1588_TMR2/FB_A1/SDRAM_D1, label: 'U14[4]/SDRAM_D1', identifier: SDRAM_D1}
- {pin_num: D6, pin_signal: PTC27/LPUART0_RTS_b/ENET0_1588_TMR1/FB_A2/SDRAM_D2, label: 'U14[5]/SDRAM_D2', identifier: SDRAM_D2}
- {pin_num: E6, pin_signal: PTC26/LPUART0_CTS_b/ENET0_1588_TMR0/FB_A3/SDRAM_D3, label: 'U14[7]/SDRAM_D3', identifier: SDRAM_D3}
- {pin_num: F6, pin_signal: ADC0_SE6a/PTE18/LLWU_P20/SPI0_SOUT/UART2_CTS_b/I2C0_SDA, label: 'J12[4]/J26[A8]/U15[6]/I2C0_SDA', identifier: ACCEL_I2C_SDA}
- {pin_num: M6, pin_signal: VBAT, label: 'J3[2]/K65_VBAT'}
- {pin_num: A7, pin_signal: PTC25/LPUART0_RX/FB_A4/SDRAM_D4, label: 'U14[8]/SDRAM_D4', identifier: SDRAM_D4}
- {pin_num: B7, pin_signal: PTC24/LPUART0_TX/FB_A5/SDRAM_D5, label: 'U14[10]/SDRAM_D5', identifier: SDRAM_D5}
- {pin_num: C7, pin_signal: PTC19/UART3_CTS_b/ENET0_1588_TMR3/FB_CS3_b/FB_BE7_0_BLS31_24_b/SDRAM_DQM0/FB_TA_b, label: 'U14[16]/SDRAM_DQM0', identifier: SDRAM_DQM0}
- {pin_num: D7, pin_signal: PTC18/UART3_RTS_b/ENET0_1588_TMR2/FB_TBST_b/FB_CS2_b/FB_BE15_8_BLS23_16_b/SDRAM_DQM1, label: 'U14[71]/SDRAM_DQM1', identifier: SDRAM_DQM1}
- {pin_num: E7, pin_signal: PTC17/CAN1_TX/UART3_TX/ENET0_1588_TMR1/FB_CS4_b/FB_TSIZ0/FB_BE31_24_BLS7_0_b/SDRAM_DQM3, label: 'U14[59]/SDRAM_DQM3', identifier: SDRAM_DQM3}
- {pin_num: F7, pin_signal: ADC0_SE7a/PTE19/SPI0_SIN/UART2_RTS_b/I2C0_SCL/CMP3_OUT, label: 'J12[3]/J26[A7]/U15[4]/I2C0_SCL', identifier: ACCEL_I2C_SCL}
- {pin_num: K7, pin_signal: ADC0_SE18/PTE25/LLWU_P21/CAN1_RX/UART4_RX/I2C0_SDA/EWM_IN, label: 'J26[A47]/J26[B30]/CAN1_RX/ADC0_SE18'}
- {pin_num: L7, pin_signal: ADC0_SE17/PTE24/CAN1_TX/UART4_TX/I2C0_SCL/EWM_OUT_b, label: 'J26[A48]/J26[B29]/CAN1_TX/ADC0_SE17'}
- {pin_num: M7, pin_signal: PTE28, label: 'J26[B61]/J26[B62]/U15[9]/ACCL_INT2', identifier: ACCEL_I2C_INT2}
- {pin_num: A8, pin_signal: ADC1_SE6b/PTC10/I2C1_SCL/FTM3_CH6/I2S0_RX_FS/FB_AD5/SDRAM_A13, label: 'J26[A75]/U14[27]/FB_AD5/SDRAM_A13', identifier: SDRAM_A13}
- {pin_num: B8, pin_signal: PTC13/UART4_CTS_b/FTM_CLKIN1/FB_AD26/SDRAM_D26/TPM_CLKIN1, label: 'J26[B78]/U14[48]/FB_AD26/SDRAM_D26', identifier: SDRAM_D26}
- {pin_num: C8, pin_signal: PTC14/UART4_RX/FB_AD25/SDRAM_D25, label: 'J26[B79]/U14[47]/FB_AD25/SDRAM_D25', identifier: SDRAM_D25}
- {pin_num: D8, pin_signal: PTC15/UART4_TX/FB_AD24/SDRAM_D24, label: 'J26[B80]/U14[45]/FB_AD24/SDRAM_D24', identifier: SDRAM_D24}
- {pin_num: E8, pin_signal: PTC16/CAN1_RX/UART3_RX/ENET0_1588_TMR0/FB_CS5_b/FB_TSIZ1/FB_BE23_16_BLS15_8_b/SDRAM_DQM2, label: 'U14[28]/SDRAM_DQM2', identifier: SDRAM_DQM2}
- {pin_num: F8, pin_signal: TSI0_CH9/PTB16/SPI1_SOUT/UART0_RX/FTM_CLKIN0/FB_AD17/SDRAM_D17/EWM_IN/TPM_CLKIN0, label: 'J26[B68]/U14[33]/FB_AD17/SDRAM_D17', identifier: SDRAM_D17}
- {pin_num: K8, pin_signal: PTE26/ENET_1588_CLKIN/UART4_CTS_b/RTC_CLKOUT/USB0_CLKIN, label: 'J26[B24]/ENET_1588_CLKIN', identifier: RMII_CLKIN;ENET_1588_CLKIN}
- {pin_num: L8, pin_signal: PTE27/UART4_RTS_b, label: 'J26[B55]/J26[B56]/U15[11]/ACCL_INT1', identifier: ACCEL_I2C_INT1}
- {pin_num: M8, pin_signal: TSI0_CH4/PTA3/UART0_RTS_b/FTM0_CH0/LPUART0_RTS_b/JTAG_TMS/SWD_DIO, label: 'J18[2]/U7[3]/JTAG_TMS/SWD_DIO', identifier: SWD_DIO}
- {pin_num: N8, pin_signal: TSI0_CH1/PTA0/UART0_CTS_b/UART0_COL_b/FTM0_CH5/LPUART0_CTS_b/JTAG_TCLK/SWD_CLK/EZP_CLK, label: 'J18[4]/U6[3]/JTAG_TCLK/SWD_CLK', identifier: SWD_CLK}
- {pin_num: A9, pin_signal: ADC1_SE7b/PTC11/LLWU_P11/I2C1_SDA/FTM3_CH7/I2S0_RXD1/FB_RW_b, label: 'J26[B57]/J26[B58]/J26[B71]/FB_RW'}
- {pin_num: B9, pin_signal: PTC12/UART4_RTS_b/FTM_CLKIN0/FB_AD27/SDRAM_D27/FTM3_FLT0/TPM_CLKIN0, label: 'J26[B77]/U14[50]/FB_AD27/SDRAM_D27', identifier: SDRAM_D27}
- {pin_num: C9, pin_signal: ADC1_SE5b/CMP0_IN3/PTC9/FTM3_CH5/I2S0_RX_BCLK/FB_AD6/SDRAM_A14/FTM2_FLT0, label: 'J26[A74]/U14[26]/FB_AD6/SDRAM_A14', identifier: SDRAM_A14}
- {pin_num: D9, pin_signal: PTB21/SPI2_SCK/FB_AD30/SDRAM_D30/CMP1_OUT, label: 'J26[B74]/U14[54]/FB_AD30/SDRAM_D30', identifier: SDRAM_D30}
- {pin_num: E9, pin_signal: PTB15/CAN1_RX/FB_A6/SDRAM_D6, label: 'U14[11]/SDRAM_D6', identifier: SDRAM_D6}
- {pin_num: F9, pin_signal: PTB9/SPI1_PCS1/UART3_CTS_b/FB_AD20/SDRAM_D20, label: 'U14[37]/SDRAM_D20', identifier: SDRAM_D20}
- {pin_num: G9, pin_signal: ADC1_SE14/PTB10/SPI1_PCS0/UART3_RX/FB_AD19/SDRAM_D19/FTM0_FLT1, label: 'J26[B70]/U14[36]/FB_AD19/SDRAM_D19', identifier: SDRAM_D19}
- {pin_num: H9, pin_signal: ADC1_SE10/PTB4/ENET0_1588_TMR2/SDRAM_CS1_b/FTM1_FLT0, label: D6/LED_1, identifier: LED_YELLOW}
- {pin_num: J9, pin_signal: PTA31/CAN0_RX/FB_A10/SDRAM_D10, label: 'J26[B41]/U14[77]/SDRAM_D10/CAN0_RX', identifier: SDRAM_D10}
- {pin_num: K9, pin_signal: ADC0_SE11/PTA8/FTM1_CH0/RMII0_MDC/MII0_MDC/FTM1_QD_PHA/TPM1_CH0/TRACE_D2, label: 'J26[A13]/RMII0_MDC', identifier: RMII0_MDC}
- {pin_num: L9, pin_signal: TSI0_CH5/PTA4/LLWU_P3/FTM0_CH1/NMI_b/EZP_CS_b, label: SW2/NMI, identifier: SW2}
- {pin_num: M9, pin_signal: TSI0_CH3/PTA2/UART0_TX/FTM0_CH7/I2C3_SCL/LPUART0_TX/JTAG_TDO/TRACE_SWO/EZP_DO, label: 'J26[A42]/UART0_TX'}
- {pin_num: N9, pin_signal: TSI0_CH2/PTA1/UART0_RX/FTM0_CH6/I2C3_SDA/LPUART0_RX/JTAG_TDI/EZP_DI, label: 'J26[A41]/UART0_RX'}
- {pin_num: A10, pin_signal: CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/PDB0_EXTRG/I2S0_RX_BCLK/FB_AD9/SDRAM_A17/I2S0_MCLK, label: 'J26[A71]/U14[64]/FB_AD9/SDRAM_A17', identifier: SDRAM_A17}
- {pin_num: B10, pin_signal: CMP0_IN1/PTC7/SPI0_SIN/USB0_SOF_OUT/I2S0_RX_FS/FB_AD8/SDRAM_A16, label: 'J26[A72]/FB_AD8'}
- {pin_num: C10, pin_signal: ADC1_SE4b/CMP0_IN2/PTC8/FTM3_CH4/I2S0_MCLK/FB_AD7/SDRAM_A15, label: 'J26[A73]/U14[25]/FB_AD7/SDRAM_A15', identifier: SDRAM_A15}
- {pin_num: D10, pin_signal: PTB20/SPI2_PCS0/FB_AD31/SDRAM_D31/CMP0_OUT, label: 'J26[B73]/U14[56]/FB_AD31/SDRAM_D31', identifier: SDRAM_D31}
- {pin_num: F10, pin_signal: PTB8/UART3_RTS_b/FB_AD21/SDRAM_D21, label: 'U14[39]/SDRAM_D21', identifier: SDRAM_D21}
- {pin_num: E10, pin_signal: PTB14/CAN1_TX/FB_A7/SDRAM_D7, label: 'U14[13]/SDRAM_D7', identifier: SDRAM_D7}
- {pin_num: G10, pin_signal: ADC0_SE13/TSI0_CH8/PTB3/I2C0_SDA/UART0_CTS_b/UART0_COL_b/ENET0_1588_TMR1/SDRAM_CS0_b/FTM0_FLT0, label: 'U14[20]/SDRAM_CS0', identifier: SDRAM_CS0}
- {pin_num: H10, pin_signal: PTA30/CAN0_TX/FB_A11/SDRAM_D11, label: 'J26[B42]/U14[79]/SDRAM_D11/CAN0_TX', identifier: SDRAM_D11}
- {pin_num: J10, pin_signal: PTA26/MII0_TXD3/FB_A13/SDRAM_D13/FB_A27, label: 'U14[82]/SDRAM_D13', identifier: SDRAM_D13}
- {pin_num: K10, pin_signal: PTA9/FTM1_CH1/MII0_RXD3/FTM1_QD_PHB/TPM1_CH1/TRACE_D1, label: 'J26[A11]/J29[9]/SD_DETECT', identifier: SDHC_CD}
- {pin_num: L10, pin_signal: ADC0_SE10/PTA7/FTM0_CH4/RMII0_MDIO/MII0_MDIO/TRACE_D3, label: 'J26[A14]/RMII0_MDIO', identifier: RMII0_MDIO}
- {pin_num: M10, pin_signal: PTA6/FTM0_CH3/CLKOUT/TRACE_CLKOUT, label: 'J26[B27]/U14[68]/CLKOUT', identifier: SDRAM_CLKOUT}
- {pin_num: N10, pin_signal: PTA5/USB0_CLKIN/FTM0_CH2/RMII0_RXER/MII0_RXER/CMP2_OUT/I2S0_TX_BCLK/JTAG_TRST_b, label: 'J26[B13]/RMII0_RXER', identifier: RMII0_RXER}
- {pin_num: A11, pin_signal: PTC5/LLWU_P9/SPI0_SCK/LPTMR0_ALT2/I2S0_RXD0/FB_AD10/SDRAM_A18/CMP0_OUT/FTM0_CH2, label: 'J26[A70]/U14[65]/FB_AD10/SDRAM_A18', identifier: SDRAM_A18}
- {pin_num: B11, pin_signal: PTC4/LLWU_P8/SPI0_PCS0/UART1_TX/FTM0_CH3/FB_AD11/SDRAM_A19/CMP1_OUT, label: 'J26[A69]/U14[66]/FB_AD11/SDRAM_A19', identifier: SDRAM_A19}
- {pin_num: D11, pin_signal: TSI0_CH12/PTB19/CAN0_RX/FTM2_CH1/I2S0_TX_FS/FB_OE_b/FTM2_QD_PHB/TPM2_CH1, label: 'J26[B72]/D8[1]/BRD_PAD1', identifier: TSI_ELECTRODE_2}
- {pin_num: E11, pin_signal: PTB13/UART3_CTS_b/FTM1_CH1/FTM0_CH5/FB_A8/SDRAM_D8/FTM1_QD_PHB/TPM1_CH1, label: 'U14[74]/SDRAM_D8', identifier: SDRAM_D8}
- {pin_num: F11, pin_signal: ADC1_SE13/PTB7/FB_AD22/SDRAM_D22, label: 'U14[40]/SDRAM_D22', identifier: SDRAM_D22}
- {pin_num: G11, pin_signal: ADC0_SE12/TSI0_CH7/PTB2/I2C0_SCL/UART0_RTS_b/ENET0_1588_TMR0/SDRAM_WE/FTM0_FLT3, label: 'U14[17]/SDRAM_WE', identifier: SDRAM_WE}
- {pin_num: H11, pin_signal: PTA29/MII0_COL/FB_A24, label: 'J26[A35]/D9/TP_LED2RR', identifier: LED_BLUE}
- {pin_num: J11, pin_signal: CMP3_IN5/PTA25/MII0_TXCLK/FB_A14/SDRAM_D14/FB_A28, label: 'U14[83]/SDRAM_D14', identifier: SDRAM_D14}
- {pin_num: K11, pin_signal: CMP3_IN4/PTA24/MII0_TXD2/FB_A15/SDRAM_D15/FB_A29, label: 'U14[85]/SDRAM_D15', identifier: SDRAM_D15}
- {pin_num: L11, pin_signal: CMP2_IN1/PTA13/LLWU_P4/CAN0_RX/FTM1_CH1/RMII0_RXD0/MII0_RXD0/I2C2_SDA/I2S0_TX_FS/FTM1_QD_PHB/TPM1_CH1, label: 'J26[A20]/RMII0_RXD0',
  identifier: RMII0_RXD0}
- {pin_num: M11, pin_signal: PTA11/LLWU_P23/FTM2_CH1/MII0_RXCLK/I2C2_SDA/FTM2_QD_PHB/TPM2_CH1, label: 'U16[9]/RTC_BYPASS', identifier: RTC_BYPASS}
- {pin_num: N11, pin_signal: PTA10/LLWU_P22/FTM2_CH0/MII0_RXD2/FTM2_QD_PHA/TPM2_CH0/TRACE_D0, label: 'J26[B52]/SW3', identifier: SW3}
- {pin_num: A12, pin_signal: CMP1_IN1/PTC3/LLWU_P7/SPI0_PCS1/UART1_RX/FTM0_CH2/CLKOUT/I2S0_TX_BCLK, label: 'J26[B25]/J26[B28]/J26[B59]/J26[B60]'}
- {pin_num: B12, pin_signal: ADC0_SE15/TSI0_CH14/PTC1/LLWU_P6/SPI0_PCS3/UART1_RTS_b/FTM0_CH0/FB_AD13/SDRAM_A21/I2S0_TXD0, label: 'J26[A67]/U14[22]/FB_AD13/SDRAM_A21',
  identifier: SDRAM_A21}
- {pin_num: C12, pin_signal: PTB23/SPI2_SIN/SPI0_PCS5/FB_AD28/SDRAM_D28/CMP3_OUT, label: 'J26[B76]/U14[51]/FB_AD28/SDRAM_D28', identifier: SDRAM_D28}
- {pin_num: D12, pin_signal: TSI0_CH11/PTB18/CAN0_TX/FTM2_CH0/I2S0_TX_BCLK/FB_AD15/SDRAM_A23/FTM2_QD_PHA/TPM2_CH0, label: 'J26[B66]/D9[1]/BRD_PAD2', identifier: TSI_ELECTRODE_1}
- {pin_num: E12, pin_signal: PTB12/UART3_RTS_b/FTM1_CH0/FTM0_CH4/FB_A9/SDRAM_D9/FTM1_QD_PHA/TPM1_CH0, label: 'U14[76]/SDRAM_D9', identifier: SDRAM_D9}
- {pin_num: F12, pin_signal: ADC1_SE12/PTB6/FB_AD23/SDRAM_D23, label: 'U14[42]/SDRAM_D23', identifier: SDRAM_D23}
